---
type: HermiteSurface
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# HermiteSurface

`Autodesk.Revit.DB.HermiteSurface` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | IsValid | 2017 | `public bool IsValid ()` |